//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*Console.Write("input first number ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("input second number ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
{
    Console.Write("max=" + num1 + " " + "min=" + num2);
}
else{
    Console.Write("max=" + num2 + " " + "min=" + num1);
}*/

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/* Console.Write("input int number one ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("input int number two ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("input int number three ");
int num3 = Convert.ToInt32(Console.ReadLine());
int m = num1;
if(m > num2)
{
     m = num1;
}
else {
    m = num2;
}
if(m > num3)
{
    m = m;
}
else {
    m = num3;
}
Console.Write(m); */

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/* Console.Write("input int number");
double num =Convert.ToInt32(Console.ReadLine());
if(num % 2 < 1)
 {
    Console.Write("четное");
}
else {
    Console.Write("нечетное");
} */

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

/*Console.Write("input int number");
int num1 = Convert.ToInt32(Console.ReadLine());
int current = num1 - 2;
while (current > 0)
{
    Console.Write(current + " ");
current = current - 2;

}*/